remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
	// Derivative with low-pass filter
	pid->derivative = pid->alpha * pid->d * (pid->error - pid->prev_error) / dt + (1.0f - pid->alpha) * pid->derivative;

	// PID output
	pid->output = pid->p * pid->error + pid->integral + pid->derivative;

	// Clamp output
	pid->output = LIMIT(-pid->limit, pid->output, pid->limit);

	// Store error for next iteration
	pid->prev_error = pid->error;

	return pid->output;
}

// Clip PID to 1/8 turn
#define PID_CLIP (TWO_PI / 8.0f * POLE_PAIRS)






/// Timing stuff

unsigned long microsPerReading, microsPrevious, microsUsed;



#define ANGLE_PD_COMP_FACTOR 1.3333333333f



int8_t right;
int8_t backwards;


// -- Constants --
float accelerationTargetAlpha = 0.0004f;         // Filter smoothing factor
float accelerationFeedForwardGain = -80.0f;           // Feedforward gain


MotionCommand debugCMD = {
		.command = COMMAND_QUEUE_LEFT_SIDE,
		.bibiNumber = 0,
		.newPosition = 50,
		.maxSpeed = 10,
		.acceleration = 10,
};

uint8_t sendMessage;



#define MAX_CMD_HISTORY 100

MotionCommand commandHistory[MAX_CMD_HISTORY];
uint8_t commandHistoryHead = 0;

void logReceivedCommand(MotionCommand* cmd) {
	commandHistory[commandHistoryHead] = *cmd;
	commandHistoryHead = (commandHistoryHead + 1) % MAX_CMD_HISTORY;
}



uint32_t CRC_MismatchCounter;

uint32_t strangeCommandCounter;

// Returns 1 if this command makes sense
uint8_t CMD_SanityCheck(MotionCommand cmd){

	// Increment in case we return early
	strangeCommandCounter++;

	// Acceleration shouldn't ever exceed 120
	if (cmd.acceleration > 125) return 0;

	// Movement limited to 10 meters now. Prevents rogue commands from passing through
	if (cmd.newPosition > 1000) return 0;

	// Decrement again because it passed the checks
	strangeCommandCounter--;

	// Valid message
	return 1;
}






// Main loop
int main(void) {

	// Reset of all peripherals, Initializes the Flash interface and the Systick.
	HAL_Init();

	// Configure the system clock
	SystemClock_Config();

	// Initialize all configured peripherals
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_TIM1_Init();
	MX_ADC1_Init();
	MX_USART2_UART_Init();
	MX_TIM2_Init();
	MX_ADC2_Init();
	MX_TIM6_Init();
	MX_SPI2_Init();
	MX_SPI1_Init();
	MX_SPI3_Init();
	MX_TIM4_Init();
	MX_TIM8_Init();
	CRC_Init_16_ARC();


	// Start microsecond timer, overflows after 71 minutes.
	HAL_TIM_Base_Start(&htim2);


	// Initialize ADC stuff
	ADC_Init();

	// Initialize RGB Led stuff
	RGB_Init();




	// Charge power only, no button pressed
	while (!HAL_GPIO_ReadPin(BUT1_GPIO_Port, BUT1_Pin)){

		// Update global battery Voltage
		BAT_Update();

		// Display Battery on led
		BAT_VoltageToRGB(BAT.voltage);

		// Run charge management logic
		CHG_RunLogic();
	}

	// Keep itself on
	HAL_GPIO_WritePin(SELF_TURN_ON_GPIO_Port, SELF_TURN_ON_Pin, (GPIO_PinState)1);

	// Get Bibi ID
	BIBI_Number = BIBI_GetID();

	// Initialize IMU
	IMU_Init();

	// Config radio
	NRF_Configurate();

	// Setup magnetic encoder
	ENC_Setup();

	// Initialize and enable motor driver
	MOT_Init();
	MOT_Enable();

	// Wait until stable, get gyro offsets
	IMU_WaitForStableGetGyroOffsets();

	// Turn motor on
	MOT_SetPhaseVoltage(5.65f, _3PI_2);

	//	// Wait until stable again, get gyro offsets again
	//	waitForStableGetGyroOffsets();
	HAL_Delay(2000);

	// Update encoder position
	ENC_Update();

	// And save as zero
	MOT_ZeroElectricAngle = normalizeAngle((float)(POLE_PAIRS * ENC_LastAngleRad));

	// Turn motor off
	MOT_SetPhaseVoltage(0, MOT_ZeroElectricAngle);

	// Set electrical angle target to current position
	electricalAngleTarget = ENC_LastFullAngleRad * POLE_PAIRS;







	// Begin Madwick filter at 10000hz
	filter.begin(SAMPLE_FREQUENCY);

	// initialize variables to pace updates to correct rate
	microsPerReading = 1000000 / SAMPLE_FREQUENCY;
	microsPrevious = TIM2->CNT;

	// Turn white led off
	HAL_GPIO_WritePin(LED_NOFF_GPIO_Port, LED_NOFF_Pin, (GPIO_PinState)0);

	while (1)  {

		// If another loop is due
		if (TIM2->CNT - microsPrevious >= microsPerReading) {

			// Update global battery Voltage
			BAT_Update();

			// Display Battery on led
			BAT_VoltageToRGB(BAT.voltage);

			// Run charge management logic
			CHG_RunLogic();

			// Low battery shut down
			BAT_CheckLowShutdown();

			// Check button shutdown
			SYS_ButShutdown();

			// Get IMU data and update Madgwick filter
			MAD_Update();

			// Check if the led button is pressed
			RGB_CheckFadexButton();



			// If we still have queued movements, and there's currently none running
			if (queuedMovementCount && !movement.running){

				// Pointer to next movement
				struct MovementStep* nextMovement = &queuedMovements[queuedMovementTail];

				// If it's time for the next one
				if (TIM2->CNT > nextMovement->startTime){

					// Start next queued movement
					startMovement(*nextMovement);

					// Point to next movement in line
					queuedMovementTail = (queuedMovementTail + 1) % MAX_QUE_LENGTH;

					// Decrement queued movement counter
					queuedMovementCount--;
				}
			}

			// If we have to start a new movement
			if (movement.start){
				movement.start = 0;
				movement.startTimestamp = TIM2->CNT;
				movement.running = 1;


				// If this is our first move
				if (notYetMoved){

					// Turn on the PIDs, and set the zero position
					PID_WeightAngleWithMotorSpeed.on = 1;
					diaboloZeroPosition += diaboloPosition;
					diaboloPosition = 0;
					lastDiaboloPosition = 0;
					lastDiaboloSpeed = 0;
					notYetMoved = 0;
					madgwick.turns = 0;
					//				    kalman_init(&kf);
				}

				// Turn on speed PID
				PID_BibiSpeedWithWeightAngle.on = 1;

				// Set current position as offset. Works because we're working in absolute units now.
				movement.startOffset = diaboloPosition;

				// Check what direction we're going
				movement.direction = movement.newPosition > movement.startOffset ? 1 : -1;

				// Movement planning
				p.totalDistance = ABS(movement.newPosition - movement.startOffset);
				p.rampRatio = LIMIT(0.2f, movement.acceleration, 2.55f);
				p.maxSpeed = LIMIT(0.2f, movement.maxSpeed, 2.55f);

				// Flag so the movement loop doesn't funk things up in the first run
				firstMovementLoop = 1;

				// Calculate the motion profile from the distance, acceleration, and max speed we've set.
				distanceSpeedRampRatioToProfileTimes(p);
			}


