remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
			if (movement.running){
				float runTime = (TIM2->CNT - movement.startTimestamp) / 1000000.0f;

				// Calculate position and speed targets
				positionTarget = (movement.startOffset + movement.direction * quinticPositionProfile(runTime, p.rampTime, p.cruiseTime, p.maxSpeed));

				// Set the lastPositionTarget to the positionTarget the first time we get here. Otherwise we get strange feedforwards values
				if (firstMovementLoop){
					firstMovementLoop = 0;
					lastPositionTarget = positionTarget;
					lastSpeedTarget = 0;
					PID_BibiSpeedWithWeightAngle.target = 0;
				}
				speedTarget = (positionTarget - lastPositionTarget) * SAMPLE_FREQUENCY;
				lastPositionTarget = positionTarget;

				// If we've passed the runtime, stop 'movement' (the PIDs still try to hold the current position). End when stopped if there's another movement queued.
				//				if (runTime >= p.totalTime || (runTime > 1.0f && queuedMovementCount && (movement.direction == 1 ? diaboloSpeed > 0 : diaboloSpeed < 0))) {
				if (runTime >= p.totalTime - (queuedMovementCount ? 0.25f : 0)) {
					movement.running = 0;
				}
			}


			// Check radio
			if (NRF_DataReady()) {
				NRF_GetData(buffer);
				NRF_ReceiveInterval = TIM2->CNT - NRF_ReceiveTimestamp;
				NRF_ReceiveTimestamp = TIM2->CNT;

				// Copy the buffer to the command data structure
				MotionCommand cmd;
				memcpy(&cmd, buffer, sizeof(MotionCommand));

				// Check if the CRC is valid
				if (cmd.crc == CRC_Calculate((uint8_t*)&cmd, sizeof(cmd) - 2)){

					// Get flags from command bits
					uint8_t flags = (cmd.command & 0b11100000) >> 5;

					// Remove flags from command byte
					cmd.command &= 0b11111;

					// Switch byte orders so QLab values make sense
					cmd.bibiNumber = (cmd.bibiNumber << 8) | (cmd.bibiNumber >> 8);
					cmd.newPosition = (cmd.newPosition << 8) | (cmd.newPosition >> 8);

					// Clear CRC for comparison
					cmd.crc = 0;

					// If the new command isn't the same as the last one
					if (memcmp(&lastCmd, &cmd, sizeof(MotionCommand))){

						// Copy it over as new last command
						memcpy(&lastCmd, &cmd, sizeof(MotionCommand));

						// Log command in circular buffer
						logReceivedCommand(&cmd);

						// Pass the message through the sanity check
						if (CMD_SanityCheck(cmd)){

							// If we have to do something
							if (cmd.bibiNumber == BIBI_Number || cmd.bibiNumber == 0 || (cmd.bibiNumber & (1 << (4 + BIBI_Number)))){

								// If we get a queued movement command
								if (cmd.command == COMMAND_QUEUE_LEFT_SIDE || cmd.command == COMMAND_QUEUE_RIGHT_SIDE){

									// Check movementSide
									movementSide = (cmd.command == COMMAND_QUEUE_LEFT_SIDE) ? 1 : -1;

									// Queue movement
									queueMovement((struct MovementStep){cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f}, 0);
								}

								// If we get a queued relative movement command
								else if (cmd.command == COMMAND_RELATIVE_INWARDS || cmd.command == COMMAND_RELATIVE_OUTWARDS){

									// Base direction to move, on current position, and commanded direction (only works once the diabolo is 'in the field' and knows what side he's on)
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_INWARDS)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_INWARDS)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS) movementSide = 1;

									// Queue movement
									queueMovement((struct MovementStep){diaboloPosition + cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f}, 0);
								}

								// If we get a direct queued relative movement command (only works once the diabolo is 'in the field' and knows what side he's on)
								else if (cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT || cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT){

									// Base direction to move on current position and commanded direction
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT) movementSide = 1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

									// Queue movement
									startMovement((struct MovementStep){diaboloPosition + cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f});
								}

								// Or overwrite the current movement
								else if (cmd.command == COMMAND_MOVEMENT_LEFT_SIDE || cmd.command == COMMAND_MOVEMENT_RIGHT_SIDE){

									// Check movementSide
									movementSide = (cmd.command == COMMAND_MOVEMENT_LEFT_SIDE) ? 1 : -1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

									// Start new movement directly
									startMovement((struct MovementStep){cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f});
								}

								// If we directly want to command the counter weight angle for smoother but less controlled motion
								else if (cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS || cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS){

									// Turn off speed PID
									PID_BibiSpeedWithWeightAngle.on = 0;

									// Base direction to move on current position and commanded direction
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS) movementSide = 1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

