remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
									// Directly set the weight angle PID target
									PID_WeightAngleWithMotorSpeed.target = cmd.acceleration * movementSide;
								}

								// If we get a shutdown command with the correct safety position value
								else if (cmd.command == COMMAND_SHUTDOWN && cmd.newPosition == COMMAND_SHUTDOWN_SAFETY){

									// If acceleration value is 1, we do a light-less turnoff
									if (cmd.acceleration == 1){
										HAL_GPIO_WritePin(SELF_TURN_ON_GPIO_Port, SELF_TURN_ON_Pin, (GPIO_PinState)0);
									}

									// Turn Bibis off
									SYS_Shutdown();
								}

								// If we have to turn the battery lights off
								else if (cmd.command == COMMAND_LIGHTS_OFF){

									// Simply set brightness to 0. Still feels dangerous not to have an indication they're still on!
									RGB_Brightness = 0;
									RGB_On = 0;
								}

								// If we have to turn the PID loops off, and grab hold of the counter weight
								else if (cmd.command == COMMAND_HOLD){

									// Turn weight angle PID off
									PID_WeightAngleWithMotorSpeed.on = 0;
									PID_BibiSpeedWithWeightAngle.on = 0;

									// Reset not-yet-moved flag
									notYetMoved = 1;
								}
							}
						}
					}
				}
				else {
					// Count mismatches in RAM
					CRC_MismatchCounter++;
				}
			}



			// Calculate and filter acceleration target
			accelerationTarget = (PID_BibiSpeedWithWeightAngle.target - lastSpeedTarget) * SAMPLE_FREQUENCY;
			lastSpeedTarget = PID_BibiSpeedWithWeightAngle.target;

			// Changed this without re-testing. Should be better to apply the feed forward acceleration to the full speed setpoint
			// accelerationTarget = (speedTarget - lastSpeedTarget) * SAMPLE_FREQUENCY;

			// Filter target acceleration (more relevant for remote than for quintic curves
			accelerationTargetFiltered = (1.0f - accelerationTargetAlpha) * accelerationTargetFiltered + accelerationTargetAlpha * accelerationTarget;

			// Add filtered derivative-based feedforward to angle to help drive acceleration
			float angleFeedForward = accelerationFeedForwardGain * accelerationTargetFiltered;

			// Steady state conversion formula didn't seem to help a lot
			// float angleFeedForward = K_ff * computeAngle(accelerationTargetFiltered);



			// Update encoder
			ENC_Update();





			/// Compute diabolo stats

			// Full motor angle since startup in degrees
			motorAngleFullDeg = electricalAngleTarget / POLE_PAIRS * RAD2DEG;

			// Full diabolo rotations in degrees since startup
			diaboloAngleFullDeg = motorAngleFullDeg + madgwick.angleFullDeg;

			// Diabolo position [m] since startup
			diaboloPosition = diaboloAngleFullDeg / 360.0f * DIABOLO_CIRCUMFERENCE - diaboloZeroPosition;

			// Diabolo speed [m/s]
			diaboloSpeed = SPEED_ALPHA * (diaboloPosition - lastDiaboloPosition) * (float)SAMPLE_FREQUENCY + (1.0f - SPEED_ALPHA) * diaboloSpeed;

			// Diabolo acceleration [m/s²]
			diaboloAcceleration = ACCEL_ALPHA * (diaboloSpeed - lastDiaboloSpeed) * (float)SAMPLE_FREQUENCY + (1.0f - ACCEL_ALPHA) * diaboloAcceleration;

			// Save last values
			lastDiaboloPosition = diaboloPosition;
			lastDiaboloSpeed = diaboloSpeed;





			/// PIDs

			// If we're running the speed PID
			if (PID_BibiSpeedWithWeightAngle.on){

				// Pass position target to position PID
				PID_BibiPositionWithBibiSpeed.target = positionTarget;

				// Pass calculated speed target + PID result to speed PID
				PID_BibiSpeedWithWeightAngle.target = speedTarget + runPID(&PID_BibiPositionWithBibiSpeed, diaboloPosition);

				// Set angle target based on acceleration feed forward and diabolo speed PID
				PID_WeightAngleWithMotorSpeed.target = LIMIT(-120, angleFeedForward + runPID(&PID_BibiSpeedWithWeightAngle, diaboloSpeed), 120);
			}

			// If not clear the integral
			else {
				PID_BibiSpeedWithWeightAngle.integral = 0;
			}

			// Set motor speed target with angle PID
			motorSpeedTarget += runPID(&PID_WeightAngleWithMotorSpeed, madgwick.angleFullDeg);

			// Limit motor speed (might not be necessary anymore with encoders)
			motorSpeedTarget = LIMIT(-PID_WeightAngleWithMotorSpeed.limit, motorSpeedTarget, PID_WeightAngleWithMotorSpeed.limit);

			// If the weight angle PID is on
			if (PID_WeightAngleWithMotorSpeed.on){

				// Set electrical angle target through desired motor speed
				electricalAngleTarget += motorSpeedTarget * POLE_PAIRS / (float)SAMPLE_FREQUENCY;
			}

			else {
				motorSpeedTarget = 0;
			}

			// Clip electrical angle target to 1/8 of a circle if it's gone haywire
			if (electricalAngleTarget - ENC_LastFullAngleRad * POLE_PAIRS > PID_CLIP) electricalAngleTarget = ENC_LastFullAngleRad * POLE_PAIRS + PID_CLIP;
			if (ENC_LastFullAngleRad * POLE_PAIRS - electricalAngleTarget > PID_CLIP) electricalAngleTarget = ENC_LastFullAngleRad * POLE_PAIRS - PID_CLIP;



			// Pass electrical angle target to motor position controller
			PID_MotorPositionWithVoltage.target = electricalAngleTarget;

			// Set phase voltage with motor position controller
			phaseVoltage = -runPID(&PID_MotorPositionWithVoltage, ENC_LastFullAngleRad * POLE_PAIRS);

			// Calculate current electrical angle
			electricalAngle = normalizeAngle((float)POLE_PAIRS * ENC_LastAngleRad - MOT_ZeroElectricAngle);

			// Set phase voltage (if the last PID is turned on)
			MOT_SetPhaseVoltage(PID_MotorPositionWithVoltage.on ? phaseVoltage : 0, electricalAngle);


			//			kalman_update(&kf, diaboloPosition);



			//			// Print debug data
			myData.a = microsUsed;
			myData.b = 0;//diaboloSpeed;
			myData.c = 0;//diaboloAcceleration;
			myData.d = 0;//kf.x[0];
			myData.e = 0;//kf.x[1];
			myData.f = 0;//kf.x[2];

			printFloats(myData.a, myData.b, myData.c, myData.d, myData.e, myData.f);


			// Update timing variables
			microsUsed = TIM2->CNT - microsPrevious - microsPerReading;

			microsPrevious = microsPrevious + microsPerReading;
		}
	}
}


void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

